'number' + 3 + 3 // result: number33 - рядок плюс число перетворюється на рядок
null + 3 // result: 3 - null перетворюється на нуль, тому нуль плюс 3 дорівнює 3
5 && "qwerty" // result: "qwerty" - вони два true, тому && повертає останнє
+'40' + +'2' + "hillel" // result: "42hillel" - 40 перетворюється на число і 2 так само і відбувається додавання тому отримуємо 42, потім число до рядка і конкатенація
'10' - 5 === 6 // result: false - '10' перетворюється на число, тому 10 - 5 = 5, 5 === 6 це перевірка на строгу рівність
true + false // result: 1 - булеві значення перетворюються на числа, де true це 1, а false це 0
'4px' - 3 // result: NaN - тому що в '4px' йдуть разом текст і число 
'4' - 3 // result: 1 - тому що '4' перетворюється в число
'6' + 3 ** 0 // result: 61 -   3 ** 0 = 1, а '6' + 1 = 61, оскільки + є оператор конкатинації 1 перетворюється на рядок
12 / '6' // result: 2 -   '6' рядок перетворюється на число
'10' + (5 === 6) // result: 10false - спочатку порівнюємо строгу рівність (5 === 6) і результат false, а потім відбувається конкатенація
null == '' // result: false - '' це true значення, за правилами порівняння null буде рівним тільки undefined
3 ** (9 / 3) // result: 27 - спочатку просте ділення (9 / 3) = 3, а потім піднесенні числа 3 до степеня 3: 3 ** 3 = 27
!!'false' == !!'true' // result: true - 'false' - це не порожній рядок, отже він є truthy, а !! перетворюэ в true, 'true' - це також не порожній рядок, отже він є truthy, отже !!'true' дає true, та потім порівнюємо true == true
0 || '0' && 1 // result: 1 - оператор && має вищий приорітет ніж ||, тому спочатку обчислюємо '0' && 1, '0' - це truthy значення, так як це не порожній рядок, 1 також truthy, тому результатом буде 1, потім 0 || 1 - оератор || повертає перший truthy операнд, 0 це falsy значення
(+null == false) < 1 // result: false - +null перетворює значення в число 0, отже 0 == false, тут false перетворюється в 0, отже 0 == false дає true, а true < 1, true - це 1, то 1 < 1 це false
false && true || true // result: true - спочатку false && true, де оператор && повертає перший falsy операнд, то буде false, потім false || true, оскільки другий операнд true є truthy, то результат true
false && (false || true) // result: false -  false || true, оскільки другий операнд true є truthy, то результат true, false && true, де оператор && повертає перший falsy операнд, то буде false 
(+null == false) < 1 ** 5 // result: false - +null перетворює значення в число 0, отже 0 == false, тут false перетворюється в 0, отже 0 == false дає true, а true < 1 ** 5, true - це 1, а 1 ** 5 = 1, то 1 < 1 це false